/******************************************************************************/
/*                                                                            */
/* src/libmlog/Put.c                                                          */
/*                                                                 2019/11/20 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdarg.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

/* ライブラリヘッダ */
#include <libmk.h>
#include <libmlog.h>

/* 共通ヘッダ */
#include <mlog.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* リトライ */
#define RETRY_MAX  (    10 )    /**< リトライ上限回数             */
#define RETRY_WAIT ( 10000 )    /**< リトライウェイト(マイクロ秒) */


/******************************************************************************/
/* ローカル関数宣言                                                           */
/******************************************************************************/
/* ログ出力 */
static void DoPut( char    *pFormat,
                   va_list vaList    );


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       ログ出力
 * @details     フォーマット文字列pFormatとこれに続く引数からログ出力文字列を生
 *              成し、mlogプロセスにログ出力要求を行う。
 *
 * @param[in]   *pFormat フォーマット文字列
 */
/******************************************************************************/
void LibMlogPut( char *pFormat,
                 ...            )
{
    va_list vaList;     /* 可変長引数リスト */

    /* 可変長引数リスト設定 */
    va_start( vaList, pFormat );

    /* ログ出力 */
    DoPut( pFormat, vaList );

    /* 可変長引数リスト解放 */
    va_end( vaList );

    return;
}


/******************************************************************************/
/* ローカル関数定義                                                           */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       ログ出力
 * @details     mlogタスクIDを取得した後、フォーマット文字列pFormatと可変長引数
 *              リストvaListからログ出力文字列を生成し、mlogプロセスにログ出力
 *              要求を行う。
 *
 * @param[in]   *pFormat フォーマット文字列
 * @param[in]   vaList   可変長引数リスト
 */
/******************************************************************************/
static void DoPut( char    *pFormat,
                   va_list vaList    )
{
    MkRet_t      ret;       /* 関数戻り値       */
    MkErr_t      err;       /* エラー内容       */
    uint32_t     retry;     /* リトライカウンタ */
    MkTaskId_t   taskId;    /* タスクID         */
    MlogMsgPut_t msg;       /* メッセージ       */

    /* 初期化 */
    err               = MK_ERR_NONE;
    retry             = 0;
    taskId            = MK_TASKID_NULL;
    msg.header.funcId = MLOG_FUNCID_PUT;

    memset( msg.str, 0, MLOG_STR_LENMAX + 1 );

    /* リトライ上限まで繰り返す */
    do {
        /* タスクID取得 */
        ret = LibMkTaskNameGet( "LOG", &taskId, &err );

        /* 取得結果判定 */
        if ( ret == MK_RET_SUCCESS ) {
            /* 成功 */

            break;
        }

        /* リトライ判定 */
        if ( ( err   == MK_ERR_NO_REGISTERED ) &&
             ( retry <= RETRY_MAX            )    ) {
            /* リトライ要 */

            /* ビジーウェイト */
            LibMkTimerSleep( RETRY_WAIT, NULL );
            /* リトライ回数更新 */
            retry++;
            /* リトライ */
            continue;

        } else {
            /* リトライ不要 */

            return;
        }

    } while ( true );

    /* 文字列設定 */
    vsnprintf( msg.str, MLOG_STR_LENMAX, pFormat, vaList );

    /* メッセージ送信 */
    LibMkMsgSendNB( taskId, &msg, sizeof ( MlogMsgPut_t ), NULL );

    return;
}


/******************************************************************************/
