/******************************************************************************/
/*                                                                            */
/* src/mlog/Vram.c                                                            */
/*                                                                 2019/04/06 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>
#include <string.h>

/* ライブラリヘッダ */
#include <libMk.h>

/* モジュールヘッダ */
#include "vga.h"
#include "Vram.h"


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/** VRAMアドレス計算マクロ */
#define VRAM( _ROW, _COLUMN, _OFFSET ) \
    ( pgVram[ ( _ROW ) * VGA_M3_COLUMN * 2 + ( _COLUMN ) * 2 + _OFFSET ] )

/** VRAMオフセット */
#define OFFSET_CHAR ( 0 )  /**< 文字 */
#define OFFSET_ATTR ( 1 )  /**< 属性 */


/******************************************************************************/
/* ローカル関数宣言                                                           */
/******************************************************************************/
/* 改行 */
static void doLinefeed( void );


/******************************************************************************/
/* グローバル変数定義                                                         */
/******************************************************************************/
/** VRAM */
static uint8_t *pgVram = NULL;

/** 行カーソル */
static uint32_t gRow = 0;

/** 列カーソル */
static uint32_t gColumn = 0;


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       VRAMモジュール初期化
 * @details     VRAM領域の割当てとVRAMの初期化を行う。
 */
/******************************************************************************/
void VramInit( void )
{
    uint32_t errNo;     /* エラー番号 */
    uint32_t row;       /* カーソル行 */
    uint32_t column;    /* カーソル列 */

    /* 初期化 */
    errNo = MK_IOMEM_ERR_NONE;

    /* VRAM領域割当 */
    pgVram = MkIoMemAlloc( ( void * ) 0x000B8000, 0x00008000, &errNo );

    /* 割当て結果判定 */
    if ( pgVram == NULL ) {
        /* 失敗 */

        /* TODO: アボート */
    }

    /* VRAM初期化 */
    for ( row = 0; row < VGA_M3_ROW; row++ ) {
        for ( column = 0; column < VGA_M3_COLUMN; column++ ) {
            VRAM( row, column, OFFSET_CHAR ) = ' ';
            VRAM( row, column, OFFSET_ATTR ) = VRAM_DEFAULT_ATTR;
        }
    }

    return;
}


/******************************************************************************/
/**
 * @bried       文字書込み
 * @details     文字属性attrにより文字をVRAMに書き込む。
 *
 * @param[in]   attr 文字属性
 * @param[in]   c    文字
 */
/******************************************************************************/
void VramWriteChar( uint8_t attr,
                    char    c     )
{
    /* 文字判定 */
    if ( c == '\n' ) {
        /* 改行 */

        doLinefeed();

    } else {
        /* その他 */

        /* VRAM書込み */
        VRAM( gRow, gColumn, OFFSET_CHAR ) = ( uint8_t ) c;
        VRAM( gRow, gColumn, OFFSET_ATTR ) = attr;

        /* カーソル更新 */
        gColumn++;

        /* 改行判定 */
        if ( gColumn >= VGA_M3_COLUMN ) {
            /* 改行 */

            doLinefeed();
        }
    }

    return;
}


/******************************************************************************/
/**
 * @brief       文字列書込み
 * @details     文字属性attrにより文字列pStrをVRAMに書き込む。
 *
 * @param[in]   attr  文字属性
 * @param[in]   *pStr 文字列
 */
/******************************************************************************/
void VramWriteStr( uint8_t attr,
                   char    *pStr )
{
    uint32_t idx;   /* インデックス */

    /* 初期化 */
    idx = 0;

    /* 1文字毎に繰り返す */
    while ( pStr[ idx ] != '\0' ) {
        /* 文字書込み */
        VramWriteChar( attr, pStr[ idx ] );

        /* 次の文字 */
        idx++;
    }

    return;
}


/******************************************************************************/
/* ローカル関数定義                                                           */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       改行
 * @details     改行する。必要があればスクロールする。
 */
/******************************************************************************/
static void doLinefeed( void )
{
    uint32_t column;    /* 列 */

    /* 列初期化 */
    gColumn = 0;

    /* 改行 */
    gRow++;

    /* スクロール判定 */
    if ( gRow >= VGA_M3_ROW ) {
        /* スクロール */

        /* 最下行カーソル設定 */
        gRow = VGA_M3_ROW - 1;

        /* スクロール */
        memcpy( &( VRAM( 0, 0, OFFSET_CHAR ) ),
                &( VRAM( 1, 0, OFFSET_CHAR ) ),
                ( VGA_M3_ROW - 1 ) * VGA_M3_COLUMN * 2 );

        /* 最下行初期化 */
        for ( column = 0; column < VGA_M3_COLUMN; column++ ) {
            VRAM( VGA_M3_ROW - 1, column, OFFSET_CHAR ) = ' ';
            VRAM( VGA_M3_ROW - 1, column, OFFSET_ATTR ) = VRAM_DEFAULT_ATTR;
        }
    }

    return;
}


/******************************************************************************/

