/******************************************************************************/
/*                                                                            */
/* src/include/mlog.h                                                         */
/*                                                                 2019/03/26 */
/* Copyright (C) 2019 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef MLOG_H
#define MLOG_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* 機能ID */
#define MLOG_FUNCID_PUT ( 0 )   /**< ログ出力     */
#define MLOG_FUNCID_MAX ( 0 )   /**< 機能ID最大値 */

/** 機能ID数 */
#define MLOG_FUNCID_NUM ( MLOG_FUNCID_MAX + 1 )

/* 戻り値 */
#define MLOG_OK (  0 )  /**< 正常終了 */
#define MLOG_NG ( -1 )  /**< 異常終了 */

/** ログ出力文字列最大長(null文字含まない) */
#define MLOG_STR_LENMAX ( 255 )

/** メッセージヘッダ */
typedef struct {
    uint32_t funcId;    /**< 機能ID */
} MlogMsgHdr_t;

/** ログ出力メッセージ */
typedef struct {
    MlogMsgHdr_t header;                        /**< メッセージヘッダ */
    char         str[ MLOG_STR_LENMAX + 1 ];    /**< 文字列           */
} MlogMsgPut_t;


/******************************************************************************/
#endif
